/* App */
"app.title" = "脚本助手 (Alpha)";

/* Settings Sheet */
"settings.title" = "AI 服务设置";
"settings.apiKeyLabel" = "API 密钥：";
"settings.endpointLabel" = "端点 URL：";
"settings.endpointPlaceholder" = "https://api.example.com/v1";
"settings.testConnection" = "测试连接";
"settings.modelLabel" = "模型：";
"settings.cancel" = "取消";
"settings.save" = "保存";
"settings.show" = "显示";
"settings.hide" = "隐藏";

/* Detection */
"detection.detected" = "✓ 检测到：%@";
"detection.unknown" = "？未知的输入格式";
"detection.fetching" = "✓ 检测到：%@ — 正在获取模型…";
"detection.modelsFound" = "✓ 检测到：%@ — 找到 %lu 个模型";

/* Chat */
"chat.inputPlaceholder" = "输入消息…";
"chat.notConfigured" = "请先设置 AI 服务。";
"chat.feedbackSent" = "[已将执行结果发送给 AI]";

/* Mode Toggle */
"mode.chat" = "对话";
"mode.console" = "控制台";
"mode.window" = "窗口";
"mode.autoFixProgress" = "[自动修正 %lu/%lu]";

/* Tool Use */
"tool.executing" = "[执行工具：%@]";
"tool.codePanelUpdated" = "已更新代码面板";
"tool.unknownTool" = "未知工具";
"tool.result" = "结果";
"tool.chatModeBlocked" = "对话模式下不允许此操作（只读）";

/* Context Stats Bar */
"stats.tokens" = "%1$@ %2$@ / %3$@";
"stats.tokens.noLimit" = "%@ tokens";
"stats.autoFix" = "修复 %lu/%lu";

/* Provider Display Names */
"provider.anthropic" = "Anthropic";
"provider.openai" = "OpenAI";
"provider.grok" = "Grok";
"provider.gemini" = "Gemini";
"provider.ollama" = "Ollama";
"provider.lmStudio" = "LM Studio";
"provider.jan" = "Jan";
"provider.openaiCompatible" = "OpenAI 兼容端点";
"provider.customEndpoint" = "自定义端点";
"provider.aiService" = "AI 服务";
"provider.unknown" = "未知";

/* Export */
"export.success" = "已导出至：%@";
"export.fileExists.title" = "文件已存在";
"export.fileExists.message" = "「%@」已存在，要替换它吗？";
"export.fileExists.replace" = "替换";
"export.fileExists.cancel" = "取消";
"export.menuTitleRequired.title" = "需要菜单标题";
"export.menuTitleRequired.message" = "请在脚本开头加入 # MenuTitle: 行。";
"export.error.title" = "导出失败";
"export.error.message" = "无法导出脚本：%@";

/* Import */
"import.error.title" = "导入失败";
"import.error.readFailed" = "无法读取文件：%@";
"import.success" = "已导入：%@";

/* Settings — Scripts Path */
"settings.scriptsPathLabel" = "脚本文件夹：";
"settings.scriptsPathDefault" = "默认（…/Glyphs 3/Scripts/ScriptMate/）";
"settings.scriptsPathBrowse" = "浏览…";
"settings.scriptsPathReset" = "重设为默认";

/* Settings Window */
"settings.tab.general" = "通用";
"settings.tab.aiService" = "AI 服务";
"settings.general.scriptsFolder" = "脚本文件夹：";
"settings.general.browse" = "浏览…";
"settings.general.resetDefault" = "重设为默认";
"settings.general.defaultPath" = "默认（…/Glyphs 3/Scripts/ScriptMate/）";
"settings.general.choose" = "选择";
"settings.general.language" = "对话语言：";
"settings.general.webSearch" = "论坛搜索（Glyphs 论坛）";
"settings.general.maxToolIterations" = "最大自动修正次数：";
"settings.general.maxToolIterations.manual" = "仅写码";
"settings.general.promptTier" = "提示词优化：";
"settings.general.promptTier.auto" = "自动（推荐）";
"settings.general.promptTier.full" = "完整 — 大型模型";
"settings.general.promptTier.standard" = "标准 — 中型模型";
"settings.general.promptTier.compact" = "精简 — 小型本地模型";
"settings.general.promptTier.hint" = "自动检测模型能力。若 AI 跳过步骤或回答不完整，可手动选择。";
"settings.general.environment" = "环境";
"settings.general.install" = "安装";
"settings.general.installed" = "已安装";
"settings.openSettings" = "设置…";

/* Service List Context Menu */
"settings.service.edit" = "编辑…";
"settings.service.delete" = "删除";

/* Service Editor */
"settings.editor.title" = "添加 AI 服务";
"settings.editor.type" = "类型：";
"settings.editor.add" = "添加";
"settings.editor.testing" = "正在测试连接…";
"settings.editor.connectionFailed" = "连接失败";
"settings.editor.save" = "保存";
"settings.editor.editTitle" = "编辑服务";

/* ACP Backend */
"settings.backendTypeLabel" = "后端：";
"settings.backendType.api" = "API";
"settings.backendType.acp" = "ACP Agent";
"settings.agentLabel" = "Agent：";
"settings.agentName.default" = "ACP Agent";
"settings.noAgentsFound" = "未检测到 ACP Agent";

/* ACP Toggle */
"settings.acpToggle" = "显示已安装的 ACP 代理程序";

/* Provider / Agent Popup */
"settings.providerLabel" = "供应商：";
"settings.apiKeyOptional" = "选填";
"settings.customAgent" = "自定义…";
"settings.customAgentLabel" = "指令：";

/* Bottom Toolbar */
"toolbar.run" = "执行";
"toolbar.export" = "导出";
"toolbar.import" = "导入";

/* Tab Bar */
"tab.new" = "新标签页";
"tab.history" = "历史记录";
"tab.close" = "关闭标签页";
"tab.closeOthers" = "关闭其他标签页";
"tab.delete" = "删除对话";
"tab.recentConversations" = "最近的对话";
"tab.noHistory" = "尚无对话记录";
"tab.untitled" = "未命名";

/* Chat UI Status */
"status.responding" = "响应中…";
"status.executingTool" = "执行 %@…";
"status.cancelled" = "响应已取消。";
"status.noResponse" = "未收到响应。";

/* Chat Input */
"input.placeholder" = "输入消息…";
"input.aiDisclaimer" = "AI 生成的脚本可能包含错误，执行前请自行确认。";

/* Toolbar Tooltips */
"toolbar.settings" = "设置";
"toolbar.webSearch.on" = "论坛搜索：开启";
"toolbar.webSearch.off" = "论坛搜索：关闭";
"toolbar.autoFix.on" = "自动修正：开启";
"toolbar.autoFix.off" = "自动修正：关闭";

/* Edit Code */
"edit_code.invalidParameterType" = "参数无效：start_line 和 end_line 必须为数字";
"edit_code.emptyCode" = "code 参数为空：必须提供替换的代码内容";

/* Mode Pill */
"mode.chat.pill" = "对话";
"mode.console.pill" = "控制台";
"mode.window.pill" = "窗口";
